MP/src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаказНарядов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОсмотра</name>
    <type>
      <types>EnumRef.СостоянияОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОсмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроведениеОсмотра</name>
    <attributes>
      <name>ВидПроводимогоОсмотра</name>
      <type>
        <types>EnumRef.ВидыПроводимогоОсмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.ВидыСостоянийОсмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторЗаполнения</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторыПрисоединенныхФайлов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СогласованиеРабот</name>
    <attributes>
      <name>Работы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвторРабот</name>
      <comment>Автор документа - пользователь, породивший документ.</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.Согласован</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторСогласования</name>
      <comment>Автор документа - пользователь, породивший документ.</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСогласования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиОсмотра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторыПрисоединенныхФайлов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MP/src/Enums/ВидыСостоянийОсмотра/ВидыСостоянийОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСостоянийОсмотра</name>
  <enumValues>
    <name>Ок</name>
  </enumValues>
  <enumValues>
    <name>Удов</name>
  </enumValues>
  <enumValues>
    <name>Крит</name>
  </enumValues>
  <enumValues>
    <name>НеУказан</name>
  </enumValues>
</mdclass:Enum>

MP/src/Enums/СостоянияОсмотра/СостоянияОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОсмотра</name>
  <enumValues>
    <name>НачатьОсмотр</name>
  </enumValues>
  <enumValues>
    <name>ОсмотрЗавершен</name>
  </enumValues>
</mdclass:Enum>

MP/src/Documents/ЗаказНаряд/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Удаляем комментарйи, будем проверять его по условиям
	ВыбРеквизит = ПроверяемыеРеквизиты.Найти("ПроведениеОсмотра.Комментарий");
	Если ВыбРеквизит <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ВыбРеквизит);
	КонецЕсли;     
	
	
	МассивВидовремонтаНеобхзательныхДляЗаполнения = ОбщегоНазначенияКлиентСервер.МассивНеобязательныхВидовОсмотраДлязаполнения();
	
	// Обходим строки и проверяем заполнение реквизита
    Для Индекс = 1 по ПроведениеОсмотра.Количество() Цикл
		ТекСтрока = ПроведениеОсмотра.Получить(Индекс - 1);
		
		
		Если МассивВидовремонтаНеобхзательныхДляЗаполнения.Найти(ТекСтрока.ВидПроводимогоОсмотра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.НеУказан Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не заполнена колонка ""Состояние"" в строке " + Строка(Индекс) + " списка ""Проведение осмотра""";
			
			Сообщение.Поле = "ПроведениеОсмотра[" + Строка(Индекс-1) + "].Состояние";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;

			
		ИначеЕсли ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.Удов
			ИЛИ ТекСтрока.Состояние = Перечисления.ВидыСостоянийОсмотра.Крит Тогда
			
			Если СокрЛП(ТекСтрока.Комментарий) = "" И СокрЛП(ТекСтрока.ИдентификаторыПрисоединенныхФайлов) = "" Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не заполнена колонка ""Комментарий"" или не добавлен файл в строке " + Строка(Индекс) + " списка ""Проведение осмотра""";
				
				Сообщение.Поле = "ПроведениеОсмотра[" + Строка(Индекс-1) + "].Комментарий";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	СостояниеОсмотра = Перечисления.СостоянияОсмотра.НачатьОсмотр;   
	ЗагруженВЦБ = Ложь;
	Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
